# Learning SQL Notes

This notebook shows how to connect to a mysql database and run queries

The py packages have already been installed so go to [5]

Reference: https://pandas.pydata.org/docs/reference/api/pandas.read_sql_query.html

! pip install PyMySQL
! pip install ipython-sql
! pip install mysqlclient

In [5]:
import pymysql
import pandas as pd

In [6]:
db_name = "sakila"
db_host = "localhost"
db_username = "root"
db_password = "NBA2lja1!!"

try:
    conn = pymysql.connect(host = db_host,
                           port = int(3306),
                           user = "root",
                           password = db_password,
                           db = db_name)
except e:
    print (e)
if conn:
    print ("connection successful")
else:
        print ("error")

connection successful

In [9]:
df = pd.read_sql_query(
    "show tables", conn)
df

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store